/*==============================================================================

   デバッグ出力ストリーム [debug_ostream.cpp]
                                                         Author : 51106
                                                         Date   : 2026/02/15
--------------------------------------------------------------------------------
   hal::dout グローバルインスタンスの定義ファイル。
   debug_ostream.h の説明を参照。

==============================================================================*/
#include "debug_ostream.h"

namespace hal
{
	debug_ostream dout;
}